Revit 2027 API
WireConduitTypeSet.Insert Method
Insert the specified conduit type into the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	WireConduitType item
)
Public Overridable Function Insert (
	item As WireConduitType
) As Boolean
public:
virtual bool Insert(
	WireConduitType^ item
)
abstract Insert :
        item : WireConduitType -> bool
override Insert :
        item : WireConduitType -> bool
Parameters
item WireConduitType
The conduit type to be inserted into the set.
Return Value
Boolean
Returns whether the conduit type was inserted into the set.
See Also
Reference
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace